# DividedSurface Members (2022)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2022 API
---
DividedSurface Members
DividedSurface Class Methods Properties See Also
---
The DividedSurface type exposes the following members.
# Methods
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AddIntersectionElement | Adds an intersection element to the divided surface. |
| ArePhasesModifiable | Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.  (Inherited from Element.) |
| CanBeDivided | This returns true if the reference represents a face that can be used to create a divided surface. |
| CanBeHidden | Indicates if the element can be hidden in the view. (Inherited from Element.) |
| CanBeIntersectionElement | Checks if the element can be an intersection reference. |
| CanBeLocked | Identifies if the element can be locked.  (Inherited from Element.) |
| CanDeleteSubelement | Checks if given subelement can be removed from the element.  (Inherited from Element.) |
| CanHaveAnalyticalModel | Indicates whether the Element can have an Analytical Model.  (Inherited from Element.) |
| CanHaveTypeAssigned()()()() | Identifies if the element can have a type assigned.  (Inherited from Element.) |
| ChangeTypeId(ElementId) | Changes the type of the element.  (Inherited from Element.) |
| Create | Creates a new instance of a divided surface with a default layout. |
| DeleteEntity | Deletes the existing entity created by %schema% in the element  (Inherited from Element.) |
| DeleteSubelement | Removes a subelement from the element.  (Inherited from Element.) |
| DeleteSubelements | Removes the subelements from the element.  (Inherited from Element.) |
| Dispose | (Inherited from Element.) |
| Equals | Determines whether the specified Object is equal to the current Object. (Inherited from Object.) |
| GetAllIntersectionElements | Gets all intersection elements which produce division lines. |
| GetAnalyticalModel | Retrieves writeable Analytical Model for Element.  (Inherited from Element.) |
| GetAnalyticalModelId | Retrieves the Element Id of the Analytical Model Element for this Element.  (Inherited from Element.) |
| GetDependentElements | Get all elements that, from a logical point of view, are the children of this Element.  (Inherited from Element.) |
| GetDividedSurfaceForReference | Get a divided surface for a given reference. Returns null if the reference does not host a divided surface. |
| GetEntity | Returns the existing entity corresponding to the Schema if it has been saved in the Element, or an invalid entity otherwise.  (Inherited from Element.) |
| GetEntitySchemaGuids | Returns the Schema guids of any Entities stored in this element.  (Inherited from Element.) |
| GetExternalFileReference | Gets information pertaining to the external file referenced by the element.  (Inherited from Element.) |
| GetExternalResourceReference | Gets the ExternalResourceReference associated with a specified external resource type.  (Inherited from Element.) |
| GetExternalResourceReferences | Gets the full map of the external resource references referenced by the element.  (Inherited from Element.) |
| GetGeneratingElementIds | Returns the ids of the element(s) that generated the input geometry object.  (Inherited from Element.) |
| GetGeometryObjectFromReference | Retrieve one geometric primitive contained in the element given a reference.  (Inherited from Element.) |
| GetGridNodeLocation | Specify whether a particular grid node is interior to the surface, on the boundary, or outside the boundary. |
| GetGridNodeReference | Get a reference to the geometric point associated with a grid node. |
| GetGridNodeUV | Get the position of a grid node in UV coordinates in the surface. |
| GetGridSegmentReference | Get a reference to a line segment connecting two adjacent grid nodes. |
| GetHashCode | Serves as a hash function for a particular type.  (Inherited from Object.) |
| GetMaterialArea | Gets the area of the material with the given id.  (Inherited from Element.) |
| GetMaterialIds | Gets the element ids of all materials present in the element.  (Inherited from Element.) |
| GetMaterialVolume | Gets the volume of the material with the given id.  (Inherited from Element.) |
| GetMonitoredLinkElementIds | Provides the link instance IDs when the element is monitoring.  (Inherited from Element.) |
| GetMonitoredLocalElementIds | Provides the local element IDs when the element is monitoring.  (Inherited from Element.) |
| GetOrderedParameters | Gets the parameters associated to the element in order.  (Inherited from Element.) |
| GetParameter | Retrieves a parameter from the element given identifier. (Inherited from Element.) |
| GetParameterFormatOptions | Returns a FormatOptions override for the element Parameter, or a default FormatOptions if no override exists.  (Inherited from Element.) |
| GetParameters | Retrieves the parameters from the element via the given name. (Inherited from Element.) |
| GetPhaseStatus | Gets the status of a given element in the input phase  (Inherited from Element.) |
| GetReferencesWithDividedSurfaces | For a given host element get references to all the faces that host a divided surface |
| GetSubelements | Returns the collection of element subelements.  (Inherited from Element.) |
| GetTileFamilyInstance | Get a reference to a tile element associated with a given seed node. |
| GetTileReference | Get a reference to one of the tile surfaces associated with a given seed node. |
| GetType | Gets the Type of the current instance. (Inherited from Object.) |
| GetTypeId | Returns the identifier of this element's type.  (Inherited from Element.) |
| GetValidTypes()()()() | Obtains a set of types that are valid for this element.  (Inherited from Element.) |
| HasPhases | Returns true if this Element has the properties CreatedPhaseId and DemolishedPhaseId.  (Inherited from Element.) |
| IsCreatedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
| IsDemolishedPhaseOrderValid | Returns true if createdPhaseId and demolishedPhaseId are in order.  (Inherited from Element.) |
| IsExternalFileReference | Determines whether this Element represents an external file.  (Inherited from Element.) |
| IsHidden | Identifies if the element has been permanently hidden in the view. (Inherited from Element.) |
| IsMonitoringLinkElement | Indicate whether an element is monitoring any elements in any linked models.  (Inherited from Element.) |
| IsMonitoringLocalElement | Indicate whether an element is monitoring other local elements.  (Inherited from Element.) |
| IsPhaseCreatedValid | Returns true if createdPhaseId is an allowed value for the property CreatedPhaseId in this Element.  (Inherited from Element.) |
| IsPhaseDemolishedValid | Returns true if demolishedPhaseId is an allowed value for the property DemolishedPhaseId in this Element.  (Inherited from Element.) |
| IsSeedNode | Reports whether a grid node is a "seed node," a node that is associated with one or more tiles. |
| IsValidType(ElementId) | Checks if given type is valid for this element.  (Inherited from Element.) |
| LookupParameter | Attempts to find a parameter on the element which has the given name. (Inherited from Element.) |
| RefersToExternalResourceReference | Determines whether this Element uses external resources associated with a specified external resource type.  (Inherited from Element.) |
| RefersToExternalResourceReferences | Determines whether this Element uses external resources.  (Inherited from Element.) |
| RemoveAllIntersectionElements | Removes all the intersection elements from a divided surface. |
| RemoveIntersectionElement | Removes an intersection element from a divided surface. |
| SetEntity | Stores the entity in the element. If an Entity described by the same Schema already exists, it is overwritten.  (Inherited from Element.) |
| ToString | Returns a string that represents the current object. (Inherited from Object.) |

# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| AllGridRotation | Angle of rotation applied to the U- and V- directions together. |
| AssemblyInstanceId | The id of the assembly instance to which the element belongs.  (Inherited from Element.) |
| BorderTile | Determines the handling of tiles that overlap the surface's boundary. |
| BoundingBox | Retrieves a box that circumscribes all geometry of the element. (Inherited from Element.) |
| Category | Retrieves a Category object that represents the category or sub category in which the element resides. (Inherited from Element.) |
| ComponentRotation | The rotation of the pattern by a multiple of 90 degrees. |
| CreatedPhaseId | Id of a Phase at which the Element was created.  (Inherited from Element.) |
| DemolishedPhaseId | Id of a Phase at which the Element was demolished.  (Inherited from Element.) |
| DesignOption | Returns the design option to which the element belongs. (Inherited from Element.) |
| Document | Returns the Document in which the Element resides. (Inherited from Element.) |
| Geometry | Retrieves the geometric representation of the element. (Inherited from Element.) |
| GroupId | The id of the group to which an element belongs.  (Inherited from Element.) |
| Host | The element whose surface has been divided. |
| HostReference | A reference to the divided face on the host. |
| Id | A unique identifier for an Element in an Autodesk Revit project.  (Inherited from Element.) |
| IsComponentFlipped | Whether the pattern is flipped. |
| IsComponentMirrored | Whether the pattern is mirror-imaged. |
| IsTransient | Indicates whether an element is transient or permanent.  (Inherited from Element.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from Element.) |
| LevelId | The id of the level associated with the element.  (Inherited from Element.) |
| Location | This property is used to find the physical location of an element within a project. (Inherited from Element.) |
| Name | A human readable name for the Element. (Inherited from Element.) |
| NumberOfUGridlines | Get the number of U-gridlines used on the surface. |
| NumberOfVGridlines | Get the number of V-gridlines used on the surface. |
| OwnerViewId | The id of the view that owns the element.  (Inherited from Element.) |
| [Parameter[([( Guid])]) ](2e852bc4-46c6-5598-cc45-0eaf38cf8973.md "Parameter Property \(Guid\)") | Retrieves a parameter from the element given a GUID for a shared parameter. (Inherited from Element.) |
| [Parameter[([( BuiltInParameter])]) ](2f91a9f3-7f69-72f9-08d6-a2d71dfb33db.md "Parameter Property \(BuiltInParameter\)") | Retrieves a parameter from the element given a parameter id. (Inherited from Element.) |
| [Parameter[([( Definition])]) ](87d8a88c-906e-85a9-f575-f263788b8584.md "Parameter Property \(Definition\)") | Retrieves a parameter from the element based on its definition. (Inherited from Element.) |
| Parameters | Retrieves a set containing all of the parameters that are contained within the element. (Inherited from Element.) |
| ParametersMap | Retrieves a map containing all of the parameters that are contained within the element. (Inherited from Element.) |
| Pinned | Identifies if the element has been pinned to prevent changes.  (Inherited from Element.) |
| UniqueId | A stable unique identifier for an element within the document.  (Inherited from Element.) |
| UPatternIndent | The offset applied to the pattern by an integral number of grid nodes in the U-direction. |
| USpacingRule | Access to the rule for laying out the first series of equidistant parallel lines on the surface. |
| VersionGuid | Get the element version Guid.  (Inherited from Element.) |
| ViewSpecific | Identifies if the element is owned by a view.  (Inherited from Element.) |
| VPatternIndent | The offset applied to the pattern by an integral number of grid nodes in the V-direction. |
| VSpacingRule | Access to the rule for laying out the second series of equidistant parallel lines on the surface. |
| WorksetId | Get Id of the Workset which owns the element.  (Inherited from Element.) |

# See Also
DividedSurface Class
Autodesk.Revit.DB Namespace